In [3]:
# List of High schools
high_schools = ["Hernandez High School", "Figuera High School", "Wilson High School", "Wright High School"]

for school in high_schools:
    print(school)

Hernandez High School
Figuera High School
Wilson High School
Wright High School

In [20]:
high_school_types = [{"High School":"Griffin", "Type":"District"},
                    {"High School":"Figuearoa", "Type": "District"},
                    {"High School":"Wilson", "Type": "Charter"},
                    {"High School":"Wright", "Type": "Charter"}]
for i in range(len(high_school_types)):
    print (high_school_types[i])

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figuearoa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [24]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [25]:
#Add the Pandas Dependency
import pandas as pd

In [26]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [38]:
for i in range (len(school_series)):
    print(school_series[i])

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [40]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [41]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [54]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [59]:
#Initialize a new Dataframe

schools_df = pd.DataFrame()

In [60]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Print the DataFrame.
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [62]:
schools_df["School name"]= school_name
schools_df

   School ID            School name
0          0      Huang High School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School

In [64]:
schools_df["Type"]= type_of_school
schools_df

   School ID            School name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [66]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [70]:
pd.DataFrame.from_dict (high_schools_dict)

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [71]:
#List of Column names
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [72]:
#Get the indices
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [73]:
#Get values
school_df.values

array([[0, 'Huang High    School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [79]:
#Skill Drill - create lists and then add each list to a new Panda Data frame
Skill_schools =["Huang High", "Figueroa High", "Shelton High"]
Skill_school_id =[0,1,2]
Skill_school_type =["District", "District", "Charter"]

In [80]:
#Create empty Dataframe
Skill_newdataframe_df = pd.DataFrame()

In [81]:
# Add the list to a new DataFrame.
Skill_newdataframe_df["School ID"] = Skill_school_id
Skill_newdataframe_df["Schools"] = Skill_schools
Skill_newdataframe_df["Type"] = Skill_school_type
# Print the DataFrame.
Skill_newdataframe_df

   School ID        Schools      Type
0          0     Huang High  District
1          1  Figueroa High  District
2          2   Shelton High   Charter